02_Simulation/baseline/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-4; // Inizializzazione a un valore stabile basso

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 1; // Valore di primo guess, verrà sovrascritto
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-4; // Turbolenza dell'aria ferma risucchiata
        value           uniform 1e-4;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 1e-10;
    }
    farfield
    {
        type            inletOutlet;
        inletValue      uniform 1e-4; // Turbolenza del farfield asintotico
        value           uniform 1e-4;
    }
    axis
    {
        type            empty;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //