02_Simulation/baseline/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

scale 0.001;

vertices
(
    (-2.00000000 0.00000000 0.00000000)
    (-2.00000000 15.48524743 0.67610050)
    (-2.00000000 15.48524743 -0.67610050)
    (-2.00000000 11.93363101 0.52103358)
    (-2.00000000 11.93363101 -0.52103358)
    (-2.00000000 357.45945368 15.60701680)
    (-2.00000000 357.45945368 -15.60701680)
    (0.00000000 0.00000000 0.00000000)
    (0.00000000 15.48524743 0.67610050)
    (0.00000000 15.48524743 -0.67610050)
    (0.00000000 11.93363101 0.52103358)
    (0.00000000 11.93363101 -0.52103358)
    (0.00000000 357.45945368 15.60701680)
    (0.00000000 357.45945368 -15.60701680)
    (18.99038106 0.00000000 0.00000000)
    (18.99038106 4.53158121 0.19785311)
    (18.99038106 4.53158121 -0.19785311)
    (18.99038106 11.93363101 0.52103358)
    (18.99038106 11.93363101 -0.52103358)
    (18.99038106 357.45945368 15.60701680)
    (18.99038106 357.45945368 -15.60701680)
    (20.99038106 0.00000000 0.00000000)
    (20.99038106 3.99619289 0.17447755)
    (20.99038106 3.99619289 -0.17447755)
    (20.99038106 11.93363101 0.52103358)
    (20.99038106 11.93363101 -0.52103358)
    (20.99038106 357.45945368 15.60701680)
    (20.99038106 357.45945368 -15.60701680)
    (21.68497377 0.00000000 0.00000000)
    (21.68497377 4.05690404 0.17712826)
    (21.68497377 4.05690404 -0.17712826)
    (21.68497377 11.93363101 0.52103358)
    (21.68497377 11.93363101 -0.52103358)
    (21.68497377 357.45945368 15.60701680)
    (21.68497377 357.45945368 -15.60701680)
    (49.38482431 0.00000000 0.00000000)
    (49.38482431 8.93648634 0.39017542)
    (49.38482431 8.93648634 -0.39017542)
    (49.38482431 11.93363101 0.52103358)
    (49.38482431 11.93363101 -0.52103358)
    (49.38482431 357.45945368 15.60701680)
    (49.38482431 357.45945368 -15.60701680)
    (536.70000000 0.00000000 0.00000000)
    (536.70000000 8.93648634 0.39017542)
    (536.70000000 8.93648634 -0.39017542)
    (536.70000000 11.93363101 0.52103358)
    (536.70000000 11.93363101 -0.52103358)
    (536.70000000 357.45945368 15.60701680)
    (536.70000000 357.45945368 -15.60701680)
);

blocks
(
    // --- INTERNO UGELLO (Axis -> R_wall) ---
    hex (0 7 9 2  0 7 8 1) (8 32 1) simpleGrading (1.0 0.6666666666666667 1)
    hex (7 14 16 9  7 14 15 8) (116 32 1) simpleGrading (0.4 0.6666666666666667 1)
    hex (14 21 23 16  14 21 22 15) (22 32 1) simpleGrading (0.7999999999999999 0.6666666666666667 1)
    hex (21 28 30 23  21 28 29 22) (8 32 1) simpleGrading (1.25 0.6666666666666667 1)
    hex (28 35 37 30  28 35 36 29) (169 32 1) simpleGrading (2.5 0.6666666666666667 1)
    hex (35 42 44 37  35 42 43 36) (228 32 1) simpleGrading (30.0 0.6666666666666667 1)

    // --- FARFIELD ESTERNO UGELLO (R_lip -> Y4) (Blocco Unificato dipendente da X_ext_in) ---
    hex (25 39 41 27  24 38 40 26) (52 137 1) simpleGrading (0.25 50.0 1)

    // --- WAKE (R_out -> R_lip) ---
    hex (37 44 46 39  36 43 45 38) (228 14 1) simpleGrading (30.0 0.8943543879262157 1)

    // --- FARFIELD PLUME (R_lip -> Y4) ---
    hex (39 46 48 41  38 45 47 40) (228 137 1) simpleGrading (30.0 50.0 1)
);

edges
(
    arc 15 22 (19.99038106 4.12308865 0.18001794)
    arc 16 23 (19.99038106 4.12308865 -0.18001794)
    arc 22 29 (21.33767741 4.01128388 0.17513644)
    arc 23 30 (21.33767741 4.01128388 -0.17513644)
);

boundary
(
    inlet { type patch; faces (
        (2 0 0 1) // Ugello In
    ); }
    outlet { type patch; faces (
        (42 44 43 42) // Plume Out
        (44 46 45 43)  // Wake Out
        (46 48 47 45)  // Farfield Out
    ); }
    walls { type wall; faces (
        (9 2 1 8) (16 9 8 15)
        (23 16 15 22) (30 23 22 29) (37 30 29 36) // Profilo Interno
        (39 37 36 38)   // Labbro verticale (step)
        (25 39 38 24) // Parete Esterna Orizzontale
    ); }
    farfield { type patch; faces (
        (27 25 24 26) // Farfield Ambient In (Sinistra)
        (41 27 26 40) // Farfield Top
        (48 41 40 47)    // Farfield Plume Top
    ); }
    axis { type empty; faces (
        (0 7 7 0) (7 14 14 7)
        (14 21 21 14) (21 28 28 21)
        (28 35 35 28) (35 42 42 35)
    ); }
    front { type wedge; faces (
        (0 7 8 1) (7 14 15 8)
        (14 21 22 15) (21 28 29 22) (28 35 36 29) (35 42 43 36)
        (24 38 40 26) // Farfield Esterno Front Unificato
        (36 43 45 38) (38 45 47 40)
    ); }
    back { type wedge; faces (
        (0 2 9 7) (7 9 16 14)
        (14 16 23 21) (21 23 30 28) (28 30 37 35) (35 37 44 42)
        (25 27 41 39) // Farfield Esterno Back Unificato
        (37 39 46 44) (39 41 48 46)
    ); }
);
