02_Simulation/baseline/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoCentralFoam;
startFrom       latestTime;
startTime       0;

// Simulation time horizon based on theoretical FTT = 0.363 ms.
// 2.0 ms corresponds to approximately 5.5 Flow Through Times, 
// ensuring proper evacuation of startup transients and steady-state convergence.
stopAt          endTime;
endTime         0.0015;

// Adaptive Time Stepping for supersonic transient management
deltaT          1e-09;
adjustTimeStep  yes;
maxCo           0.4;
maxDeltaT       1e-06;

// Uniform time-domain sampling (forces exact 10 us writing intervals)
writeControl    adjustableRunTime;
writeInterval   1e-5;
purgeWrite      0;

// Binary format ensures thermodynamic precision and optimal I/O performance
writeFormat     binary; 
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    // --- DYNAMIC EXIT PLANE INCLUSION (X4) ---
    // Automatically imports Thrust, Mass Flow, and Velocity computed by genSTR.py
    #include "exitPlaneFunction"

    // --- VOLUMETRIC COURANT NUMBER FIELD ---
    CourantNumberField
    {
        type            CourantNo;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }

    // --- VOLUMETRIC Y+ FIELD ---
    yPlusField
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }

    // --- VOLUMETRIC MACH NUMBER FIELD ---
    MachField
    {
        type            MachNo;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }

    // --- INLET MASS FLOW
    inletMassFlow
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   100;
        log             true;
        valueOutput     true;
        writeFields     false;
        writeToFile     true;
        regionType      patch;
        name            inlet; 
        operation       areaIntegrate;
        fields          (massFlowDensity);
    }

    // --- TIME-AVERAGED STEADY FIELDS ---
    // Bypasses the initial transient and averages exclusively the asymptotic regime.
    // Starts averaging after ~3 FTTs.
    averageFields
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        
        writeControl    writeTime; 
        timeStart       0.00095;       // ~ 3*FTT

        fields
        (
            U { mean on; prime2Mean off; base time; }
            p { mean on; prime2Mean off; base time; }
            T { mean on; prime2Mean off; base time; }
            rho { mean on; prime2Mean off; base time; }
        );
    }
}

// ************************************************************************* //