02_Simulation/baseline/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\       /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\     /   O peration     | Website:  https://openfoam.org
    \\   /    A nd           | Version:  2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 16;

method          scotch;

// ************************************************************************* //